namespace IARA.Common.Enums
{
    public enum CatchTypeCodesEnum
    {
        /// <summary>
        /// Улов на борда по време на риболовната активност
        /// </summary>
        ONBOARD,

        /// <summary>
        /// Улов, разпределен към квота
        /// </summary>
        ALLOCATED_TO_QUOTA,

        /// <summary>
        /// Улов, взет като проба за оценка на състава на улова
        /// </summary>
        SAMPLE,

        /// <summary>
        /// Улов, съхраняван в мрежа по време на дейността
        /// </summary>
        KEPT_IN_NET,

        /// <summary>
        /// Улов, взет на борда по време на риболовната активност
        /// </summary>
        TAKEN_ONBOARD,

        /// <summary>
        /// Улов или морски животни, освободени по време на дейността (уловът се освобождава, ако мрежата никога не е била затворена 
        /// след точката на извличане, както е определено в регионалните планове за изхвърляне)
        /// </summary>
        RELEASED,

        /// <summary>
        /// Улов, изхвърлен по време на дейността
        /// </summary>
        DISCARDED,

        /// <summary>
        /// Изхвърлен улов, за който се прилагат изключенията de minimis
        /// </summary>
        DEMINIMIS,

        /// <summary>
        /// Улов, разтоварен (за декларации) или предстои да бъде разтоварен (за уведомления) от кораба или неговото оборудване по време на операцията 
        /// (напр. разтоварване, трансбордиране, преместване, изхвърляне в морето)
        /// </summary>
        UNLOADED,

        /// <summary>
        /// Улов, натоварен (за декларации) или който ще бъде натоварен (за уведомления) на кораба по време на операцията 
        /// (напр. трансбордиране, преместване).
        /// </summary>
        LOADED,

        /// <summary>
        /// Случаен улов на водни животни
        /// </summary>
        BY_CATCH
    }
}
