namespace IARA.Common.Enums
{
    public enum TariffCodesEnum
    {
        /// <summary>
        /// Достъп до електронна услуга за попълване на дневник за първа продажба
        /// </summary>
        e_First_Sell_Book,

        /// <summary>
        /// Достъп до електронна услуга за попълване на дневник с декларации за приемане за 1г.
        /// </summary>
        e_Accept_Book,

        /// <summary>
        /// Издаване на безсрочно разрешително за стопански риболов от кораби от трети държави
        /// </summary>
        a_1344,

        /// <summary>
        /// Издаване на безсрочно разрешително за стопански риболов 
        /// </summary>
        a_1211,

        /// <summary>
        /// Предоставяне на риболовен дневник
        /// </summary>
        Log_Book,

        /// <summary>
        /// Издаване на специално разрешително за улов на квотиран вид риба
        /// </summary>
        a_977_1,

        /// <summary>
        /// Достъп до електронна услуга за попълване на електронен риболовен дневник за 1г.
        /// </summary>
        e_Log_Book,

        /// <summary>
        /// Достъп до електронна услуга за попълване дневник на продажбите за 1г.
        /// </summary>
        e_Sell_Book,

        /// <summary>
        /// Стандартен билет - 1 месец (месечен)
        /// </summary>
        Ticket_standard_monthly,

        /// <summary>
        /// Билет за лица до 14-годишна възраст (безплатен) - До навършване на 14-годишна възраст
        /// </summary>
        Ticket_under14_noperiod,

        /// <summary>
        /// Билет за хора с увреждания (безплатен) - Без фиксиран срок
        /// </summary>
        Ticket_disability_noperiod,

        /// <summary>
        /// Билет за хора с увреждания (безплатен) - До изтичане на ТЕЛК решение
        /// </summary>
        Ticket_disability_disability,

        /// <summary>
        /// Билет за лица от 14- до 18-годишна възраст - 6 месеца (шестмесечен)
        /// </summary>
        Ticket_between14and18_halfyearly,

        /// <summary>
        /// Билет за лица от 14- до 18-годишна възраст - 1 месец (месечен)
        /// </summary>
        Ticket_between14and18_monthly,

        /// <summary>
        /// Билет с намаление и прилагане на членска карта на сдружение по чл. 11 ЗРА - 12 месеца (годишен)
        /// </summary>
        Ticket_association_annual,

        /// <summary>
        /// Билет с намаление и прилагане на членска карта на сдружение по чл. 11 ЗРА - 1 месец (месечен)
        /// </summary>
        Ticket_association_monthly,

        /// <summary>
        /// Билет с намаление и прилагане на членска карта на сдружение по чл. 11 ЗРА - 1 седмица (седмичен)
        /// </summary>
        Ticket_association_weekly,

        /// <summary>
        /// Билет за лицата на възраст над 60 години за жените и 65 години за мъжете - 12 месеца (годишен)
        /// </summary>
        Ticket_elder_annual,

        /// <summary>
        /// Билет за лицата на възраст над 60 години за жените и 65 години за мъжете - 1 месец (месечен)
        /// </summary>
        Ticket_elder_monthly,

        /// <summary>
        /// Билет за лицата на възраст над 60 години за жените и 65 години за мъжете - 1 седмица (седмичен)
        /// </summary>
        Ticket_elder_weekly,

        /// <summary>
        /// Билет за лицата на възраст над 60 години за жените и 65 години за мъжете - 6 месеца (шестмесечен)
        /// </summary>
        Ticket_elder_halfyearly,

        /// <summary>
        /// Предоставяне на дневник с декларации за приемане
        /// </summary>
        Accept_Book,

        /// <summary>
        /// Маркиране на мрежен риболовен уред (за всеки 100м)
        /// </summary>
        Mark_Gear_100m,

        /// <summary>
        /// Издаване на документ за регистрация на лице, развъждащо и отглеждащо риба и други водни организми
        /// </summary>
        a_1354,

        /// <summary>
        /// Издаване на удостоверение за извършване на стопански риболов с риболовен кораб до 10 бруто тона с парагади
        /// </summary>
        a_1805_Ship_Till10_Longliners,

        /// <summary>
        /// Издаване на удостоверение за извършване на стопански риболов с риболовен кораб до 10 бруто тона с риболовни уреди по букви "а" и "б"
        /// и с други разрешени риболовни уреди
        /// </summary>
        a_1805_ShipTill10_Fishing_Gears,

        /// <summary>
        /// Издаване на удостоверение за извършване на стопански риболов с риболовен кораб от 10 до 25 бруто тона с мрежени 
        /// и други разрешени риболовни уреди
        /// </summary>
        a_1805_Ship_Between_10_And_25,

        /// <summary>
        /// Издаване на удостоверение за извършване на стопански риболов с риболовен кораб от 25 до 40 бруто тона с мрежени 
        /// и други разрешени риболовни уреди
        /// </summary>
        a_1805_Ship_Between_25_And_40,

        /// <summary>
        /// Предоставяне на дневник за първа продажба
        /// </summary>
        First_Sell_Book,

        /// <summary>
        /// Предоставяне на дневник на продажбите по чл. 27, т. 3
        /// </summary>
        Sell_Book,

        /// <summary>
        /// Издаване на удостоверение за извършване на стопански риболов със специализиран уред – далян с режим разрешителен
        /// </summary>
        a_267_2_Poundnet_Comm_Fish_Lic,

        /// <summary>
        /// Издаване на удостоверение за извършване на стопански риболов със специализиран уред – далян на концесия с режим разрешителен
        /// </summary>
        a_267_2_Poundnet_Comm_Fish_Lic_concession,

        /// <summary>
        /// Издаване на удостоверение за извършване на стопански улов на други видове
        /// </summary>
        a_1805_Other_Species_Fishing,

        /// <summary>
        /// Вписване в регистъра на лицата купувачи при първа продажба на продукти от риболов
        /// </summary>
        a_2165_Reg_First_Sale_Buyer,

        /// <summary>
        /// Вписване в регистъра на центровете за първа продажба на продукти от риболов
        /// </summary>
        a_2256_Reg_First_Sale_Center,

        /// <summary>
        /// Издаване дубликат на документ, удостоверяващ право за извършване на стопански риболов
        /// </summary>
        a_2354_2_Competency_Dup,

        /// <summary>
        /// Издаване на удостоверение за извършване на стопански риболов с риболовен кораб до 10 бруто тона с мрежени уреди, волти и чепарета
        /// </summary>
        a_1805_Ship_Till10_Nets,

        /// <summary>
        /// Издаване на удостоверение за извършване на стопански риболов с риболовен кораб от 25 до 40 бруто тона с мрежени 
        /// и други разрешени риболовни уреди
        /// </summary>
        a_1805_Ship_Between_Over40,

        /// <summary>
        /// Издаване на удостоверение за извършване на стопански риболов в крайморски езера и блата с един езерен стационарен риболовен уред 
        /// или с един езерен гриб
        /// </summary>
        a_1805_Lakes_And_Swamps_Stat_Fishing_Gears,

        /// <summary>
        /// Издаване на удостоверение за извършване на стопански риболов във водите на р. Дунав с риболовен кораб с мрежени риболовни уреди
        /// </summary>
        a_1805_Dunav_Ship_Nets,

        /// <summary>
        /// Издаване на удостоверение за извършване на стопански риболов във водите на р. Дунав с риболовен кораб с капани (винтери) 
        /// за улов на риба и други водни организми
        /// </summary>
        a_1805_Dunav_Ship_Fishing_Traps,

        /// <summary>
        /// Издаване на удостоверение за извършване на стопански риболов във водите на р. Дунав с риболовен кораб с мрежени риболовни уреди 
        /// и с капани (винтери) за улов на риба и други водни организми
        /// </summary>
        a_1805_Dunav_Ship_Nets_And_Fishing_Traps,

        /// <summary>
        /// Издаване на удостоверение за извършване на стопански риболов във водите на р. Дунав в специализиран обект по чл. 3, ал. 1, т. 3 
        /// от закона - тоня, с гриб
        /// </summary>
        a_1805_Dunav_Spec_Utility,

        /// <summary>
        /// Издаване на удостоверение за извършване на стопански риболов във водите на р. Дунав (изм. - ДВ, бр. 30 от 2007 г., в сила от 10.04.2007 г.) 
        /// на есетрови риби с всякакви разрешени риболовни уреди
        /// </summary>
        a_1805_Dunav_Sturgeon_Fish,

        /// <summary>
        /// Издаване на удостоверение за извършване на стопански улов на рапани
        /// </summary>
        a_1805_Rapan,

        /// <summary>
        /// Издаване на удостоверение за извършване на стопански улов на миди и скариди
        /// </summary>
        a_1805_Mussels_Shrimps,

        /// <summary>
        /// Издаване на удостоверение за извършване на стопански улов на жаби
        /// </summary>
        a_1805_Frogs,

        /// <summary>
        /// Издаване на удостоверение за извършване на стопански улов на езерен рак
        /// </summary>
        a_1805_Lake_Crab,

        /// <summary>
        /// Участие в обучение и полагане на изпит за придобиване на правоспособност за извършване на стопански риболов
        /// </summary>
        a_2354_1_Aptitude_Cource_Exam,

        /// <summary>
        /// Черно море - В специализиран обект по чл. 3, ал. 1, т. 3 от закона - за далян от първа категория
        /// </summary>
        a_1805_Sea_Aqua_Pound_Net_Cat_1,

        /// <summary>
        /// Черно море - В специализиран обект по чл. 3, ал. 1, т. 3 от закона - за далян от втора категория
        /// </summary>
        a_1805_Sea_Aqua_Pound_Net_Cat_2,

        /// <summary>
        /// Черно море - В специализиран обект по чл. 3, ал. 1, т. 3 от закона - за воля с дължина на гриба над 450 м
        /// </summary>
        a_1805_Sea_Aqua_Grib_Above_450,

        /// <summary>
        /// Черно море - В специализиран обект по чл. 3, ал. 1, т. 3 от закона - за воля с дължина на гриба до 450 м
        /// </summary>
        a_1805_Sea_Aqua_Grib_Below_450,

        /// <summary>
        /// Черно море - В специализиран обект по чл. 3, ал. 1, т. 3 от закона - за воля с дължина на гриба до 100 м
        /// </summary>
        a_1805_Sea_Aqua_Grib_Below_100,

        /// <summary>
        /// Черно море - В крайморски езера и блата с други разрешени риболовни уреди, извън тези по буква "а"
        /// </summary>
        a_1805_Lakes_And_Swamps_Other_Fishing_Gears,

        /// <summary>
        /// За придобиване на право за извършване на стопански риболов в рибностопански обекти по чл. 3, ал. 1, т. 2 от ЗДС или в зони от тях
        /// </summary>
        a_1805_Old_Aqua,

        /// <summary>
        /// Стандартен билет - 12 месеца (годишен)
        /// </summary>
        Ticket_standard_annual,

        /// <summary>
        /// Стандартен билет - 1 седмица (седмичен)
        /// </summary>
        Ticket_standard_weekly,

        /// <summary>
        /// Стандартен билет - 6 месеца (шестмесечен)
        /// </summary>
        Ticket_standard_halfyearly,

        /// <summary>
        /// Билет за лица от 14- до 18-годишна възраст - 12 месеца (годишен)
        /// </summary>
        Ticket_between14and18_annual,

        /// <summary>
        /// Билет за лица от 14- до 18-годишна възраст - 1 седмица (седмичен)
        /// </summary>
        Ticket_between14and18_weekly,

        /// <summary>
        /// Билет с намаление и прилагане на членска карта на сдружение по чл. 11 ЗРА - 6 месеца (шестмесечен)
        /// </summary>
        Ticket_association_halfyearly,

        /// <summary>
        /// Билет за лицата на възраст над 60 години за жените и 65 години за мъжете членуващи в сдружение - 1 месец (месечен)
        /// </summary>
        Ticket_elderassociation_monthly,

        /// <summary>
        /// Билет за лицата на възраст над 60 години за жените и 65 години за мъжете членуващи в сдружение - 12 месеца (годишен)
        /// </summary>
        Ticket_elderassociation_annual,

        /// <summary>
        /// Билет за лица от 14- до 18-годишна възраст членуващи в сдружение - 1 седмица (седмичен)
        /// </summary>
        Ticket_between14and18association_weekly,

        /// <summary>
        /// Дубликат на билет за любителски риболов
        /// </summary>
        Ticket_duplicate,

        /// <summary>
        /// Билет за лица от 14- до 18-годишна възраст членуващи в сдружение - 12 месеца (годишен)
        /// </summary>
        Ticket_between14and18association_annual,

        /// <summary>
        /// Билет за лица от 14- до 18-годишна възраст членуващи в сдружение - 6 месеца (шестмесечен)
        /// </summary>
        Ticket_between14and18association_halfyearly,

        /// <summary>
        /// Билет за лицата на възраст над 60 години за жените и 65 години за мъжете членуващи в сдружение - 1 седмица (седмичен)
        /// </summary>
        Ticket_elderassociation_weekly,

        /// <summary>
        /// Билет за лицата на възраст над 60 години за жените и 65 години за мъжете членуващи в сдружение - 6 месеца (шестмесечен)
        /// </summary>
        Ticket_elderassociation_halfyearly,

        /// <summary>
        /// Билет за лица от 14- до 18-годишна възраст членуващи в сдружение - 1 месец (месечен)
        /// </summary>
        Ticket_between14and18association_monthly,

        /// <summary>
        /// Дубликат на купувач
        /// </summary>
        a_2165_3_buyer_dup,

        /// <summary>
        /// Дубликат на ЦПП
        /// </summary>
        a_2256_3_first_sale_dup,

        /// <summary>
        /// Дубликат на разрешително за извършване на стопански риболов с далян
        /// </summary>
        a_267_3_poundnet_commfish_dup,

        /// <summary>
        /// Дубликат на удостоверение за извършване на стопански риболов с далян
        /// </summary>
        a_267_7_poundnet_commfish_lic_dup,

        /// <summary>
        /// Дубликат на специално разрешително за улов на квотиран вид риба
        /// </summary>
        a_977_3_catch_quota_dup,

        /// <summary>
        /// Дубликат на разрешително за извършване на стопански риболов
        /// </summary>
        a_1211_3_commfish_dup,

        /// <summary>
        /// Дубликат на разрешително за извършване на стопански риболов от кораби от трети страни
        /// </summary>
        a_1344_1_right_to_fish_third_dup,

        /// <summary>
        /// Дубликат на удостоверение за придобито право за усвояване на ресурс на риба и други водни организми
        /// </summary>
        a_1805_3_right_to_fish_res_dup
    }
}
