export enum ApplicationStatusesEnum {
    /**
     * Начално състояние
     * */
    INITIAL,
    /**
     * Попълване от заявителя
     * */
    FILL_BY_APPL,
    /**
     * Изтеглено заявление за подпис с КЕП
     * */
    APPL_FOR_SIGN,
    /**
     * Качено валидно подписано заявление в системата
     * */
    UPLOADED_SIGNED,
    /**
     * Анулирано заявление
     * */
    CANCELED_APPL,
    /**
     * Стартирани автоматични проверки на заявлението от външни  регистри
     * */
    EXT_CHK_STARTED,
    /**
     * Проверка и корекции от служител
     * */
    INSP_CORR_FROM_EMP,
    /**
     * Необходими корекции от заявителя
     * */
    CORR_BY_USR_NEEDED,
    /**
     * Изчакване на входиране
     * */
    WAIT_ENTRY,
    /**
     * Изчакване на плащане от заявителя
     * */
    WAIT_PMT_FROM_USR,
    /**
     * Анулирано плащане
     * */
    PAYMENT_ANNUL,
    /**
     * Изчакване на проверка за редовност и основание за издаване на административен акт
     * */
    WAIT_REG_CHKS_ISS_GROUNDS,
    /**
     * Готовност за попълване на административен акт
     * */
    CAN_FILL_ADM_ACT,
    /**
     * Попълване на административен акт
     * */
    ADM_ACT_COMPLETION,
    /**
     * Издаден билет
     * */
    TICKET_ISSUED,
    /**
     * Потвърден издаден билет
     * */
    CONFIRMED_ISSUED_TICKET,
    /**
     * Входирано заявление в Eventis
     * */
    ENTERED_ASSIGNED_APPL,
    /**
     * Попълване на заявление от служител
     * */
    FILL_BY_EMP,
    /**
     * Изчакване въвеждане на платежни данни от служител
     * */
    WAIT_PAYMENT_DATA,
    /**
     * Обработка на плащането
     * */
    PAYMENT_PROCESSING
}