export enum FishingGearTypesEnum {

    /**
     * Гъргъри
     * */
    PS,

    /**
     * Лампари
     * */
    LA,

    /**
     * Далян - чл.21. ал.3 ЗРА
     * */
    DLN,

    /**
     * ???
     * */
    FPL,

    /**
     * Хрилни мрежи (закотвени)
     * */
    GNS,

    /**
     * Хрилни мрежи (дрифтерни, плаващи)
     * */
    GND,

    /**
     * Заграждащи хрилни мрежи
     * */
    GNC,

    /**
     * Тристенни хрилни мрежи
     * */
    GTR,

    /**
     * Комбинирани тристенни-хрилни мрежи
     * */
    GTN,

    /**
     * Вдигащи се мрежи, управлявани от кораба
     * */
    LNB,

    /**
     * Преносими вдигащи се мрежи
     * */
    LNP,

    /**
     * Вдигащи се мрежи (неопределени)
     * */
    LN,

    /**
     * Фиксирани хрилни мрежи (на колове)
     * */
    GNF,

    /**
     * Хрилни и оплитащи мрежи (неопределени)
     * */
    GEN,

    /**
     * Чепарета, ръчни въдичарски уреди и въдици
     * */
    LHP,

    /**
     * Чепарета, въдичарски уреди и въдици (механизирани)
     * */
    LHM,

    /**
     * Парагади и кърмаци (закотвени)
     * */
    LLS,

    /**
     * Плаващи парагади
     * */
    LLD,

    /**
     * Парагади (неопределени)
     * */
    LL,

    /**
     * Винтери или други капанни уреди (покрити)
     * */
    FPO,

    /**
    * Неизвестни и неопределени уреди и други съоражения
    * */
    MIS,

    /**
     * Бим тралове 
     * */
    TBB,

    /**
     * Дънни тралове
     * */
    OTB,

    /**
     * Otter trawls (nei)
     * */
    OT,

    /**
     * Близнецови тралове
     * */
    OTT,

    /**
     * Multiple bottom otter trawls
     * */
    OTP,

    /**
     * Дънни тралове, теглени от два кораба
     * */
    PTB,

    /**
     * Пелагични тралове, теглени от два кораба (неопределени)
     * */
    PT,

    /**
     * Дънни тралове (неопределени)
     * */
    TB,

    /**
     * Дънни тралове за норвежки омар
     * */
    TBN,

    /**
     * Дънни тралове за скариди
     * */
    TBS,

    /**
     * Bottom trawls - electric beam trawls (Pulse Beam)
     * */
    PUK,

    /**
     * Bottom trawls - electric sumwing trawls (Pulse Wing)
     * */
    PUL,

    /**
     * Пелагични тралове
     * */
    OTM,

    /**
     * Пелагични тралове, теглени от два кораба
     * */
    PTM,

    /**
     * Пелагични тралове (неопределени)
     * */
    TM,

    /**
     * Пелагични тралове за скариди
     * */
    TMS,

    /**
     * Semipelagic trawls
     * */
    TSP,

    /**
     * Други тралове
     * */
    TX,

    /**
     * Датски грибове
     * */
    SDN,

    /**
     * Шотландски грибове
     * */
    SSC,

    /**
     * Двойни грибове
     * */
    SPR,

    /**
     * Грибове (Неопределени)
     * */
    SX,

    /**
     * Грибове (Корабни)
     * */
    SV,

    /**
     * Грибове (плажни)
     * */
    SB,

    /**
     * Гъргъри, теглени от един кораб
     * */
    PS1,

    /**
     * Гъргъри, теглени от два кораб
     * */
    PS2,

    /**
     * Surrounding nets (nei)
     * */
    SUX,

    /**
     * Корабни драги
     * */
    DRB,

    /**
     * Хрилни мрежи (неопределени)
     * */
    GN
}