export enum FishingGearTypesEnum {

    /**
     * Гъргъри
     * */
    PS,

    /**
     * Лампари
     * */
    LA,

    /**
     * Далян - чл.21. ал.3 ЗРА
     * */
    DLN,

    /**
     * ???
     * */
    FPL,

    /**
     * Хрилни мрежи (закотвени)
     * */
    GNS,

    /**
     * Хрилни мрежи (дрифтерни, плаващи)
     * */
    GND,

    /**
     * Заграждащи хрилни мрежи
     * */
    GNC,

    /**
     * Тристенни хрилни мрежи
     * */
    GTR,

    /**
     * Комбинирани тристенни-хрилни мрежи
     * */
    GTN,

    /**
     * Вдигащи се мрежи, управлявани от кораба
     * */
    LNB,

    /**
     * Преносими вдигащи се мрежи
     * */
    LNP,

    /**
     * Вдигащи се мрежи (неопределени)
     * */
    LN,

    /**
     * Фиксирани хрилни мрежи (на колове)
     * */
    GNF,

    /**
     * Хрилни и оплитащи мрежи (неопределени)
     * */
    GEN,

    /**
     * Чепарета, ръчни въдичарски уреди и въдици
     * */
    LHP,

    /**
     * Чепарета, въдичарски уреди и въдици (механизирани)
     * */
    LHM,

    /**
     * Парагади и кърмаци (закотвени)
     * */
    LLS,

    /**
     * Плаващи парагади
     * */
    LLD,

    /**
     * Парагади (неопределени)
     * */
    LL,

    /**
     * Винтери или други капанни уреди (покрити)
     * */
    FPO,

    /**
    * Неизвестни и неопределени уреди и други съоражения
    * */
    MIS
}