export enum InspDeliveryTypesEnum {
    // Лично на нарушителя
    Personal,

    // Нарушителят е поканен да даде обяснения, подпише и получи екземпляр от съставения АУАН в офис на ИАРА
    Office,

    // Връчване със съдействието на друг държавен орган
    StateService,

    // Връчване чрез общинска служба или администрация по местоживеене
    ByMail,

    // Електронно връчване през Система за сигурно електронно връчване
    EDelivery,

    //Нарушителят отказва да му бъде връчен АУАН
    Refusal,

    //Нарушителят не се е явил в офис на ИАРА за връчване и получаване на копие от АУАН
    NotAppear,

    //НП е връчено лично
    DecreePersonal,

    //НП е изпратено с обратна раписка
    DecreeReturn,

    //НП е връчено чрез ИС за сигурно електронно връчване
    DecreeEDelivery,

    //НП е връчено чрез отбелязване
    DecreeTag
}