export enum PageCodeEnum {
    /**
     * №350 - Издаване на разрешително за улов на риба и други водни организми за научноизследователски цели с режим разрешителен
     * */
    SciFi,
    /**
     * Достъп на юридически лица
     * */
    LE,
    /**
     * №88 - Издаване на билет за любителски риболов с режим разрешителен
     * */
    RecFish,
    /**
    * №88-1 - Издаване на дубликат на билет за любителски риболов с режим разрешителен
    * */
    RecFishDup,

    OnlineRecFishStd,
    OnlineRecFishUnd14,
    OnlineRecFish14And18,
    OnlineRecFishElder,
    OnlineRecFishDisbl,
    OnlineRecFishAssoc,
    OnlineRecFish14And18Assoc,
    OnlineRecFishElderAssoc,

    RecFishStd,
    RecFishUnd14,
    RecFish14And18,
    RecFishElder,
    RecFishDisbl,
    RecFishAssoc,
    RecFish14And18Assoc,
    RecFishElderAssoc,
    
    /**
    * Сдружения за любителски риболов
    * */
    Assocs,

    QualiFi,
    Buyers,
    CatchQuota,
    /**
     * №1211 - Издаване на разрешително за извършване на стопански риболов с режим разрешителен
     * */
    CommFish,
    /**
     * №1211-3 - Дубликат на разрешително за извършване на стопански риболов с режим разрешителен
     * */
    DupCommFish,
    /**
     * №2354-1 - Участие в курс и изпит за правоспособност
     * */
    AptitudeCourceExam,
    /**
     * №1354 - Регистрация на лицата, които развъждат и отглеждат риба и други водни организми с режим регистрационен
     * */
    AquaFarmReg,
    /**
     * №1354-2 - Промяна в обстоятелствата - регистър аквакултурни стопанства
     * */
    AquaFarmChange,
    /**
     * №1354-1 - Прекратяване на регистрация на аквакултурно стопанство 
     * */
    AquaFarmDereg,
    /**
     * №1806-2 - Промяна в обстоятелствата - регистър кораби
     * */
    ShipRegChange,
    /**
     * №1805 - Издаване на удостоверения за придобито право за усвояване на ресурс на риба и други водни организми 
     * (удостоверение за право за извършване на стопански риболов) с режим разрешителен
     * */
    RightToFishResource,
    /**
     * №1805-3 - Дубликат на удостоверения за придобито право за усвояване на ресурс на риба и други водни организми
     * (удостоверение за право за извършване на стопански риболов) с режим разрешителен
     * */
    DupRightToFishResource,
    /**
     * №1344 - Издаване на разрешително за извършване на стопански риболов от кораби от трети държави с режим разрешителен
     * */
    RightToFishThirdCountry,
    /**
     * №1344-1 - Дубликат на разрешително за извършване на стопански риболов от кораби от трети държави с режим разрешителен
     * */
    DupRightToFishThirdCountry,
    /**
     * №1806-5 - Прехвърляне на свободен риболовен капацитет от удостоверение
     * */
    TransferFishCap,
    /**
    * №1806 - Издаване на дубликат на удостоверение за свободен риболовен капацитет
    * */
    CapacityCertDup,
    /**
     * №267 - Издаване на разрешително за извършване на стопански риболов със специализиран уред – далян с режим разрешителен
     * */
    PoundnetCommFish,
    /**
     * №267-3 - Дубликат на разрешително за извършване на стопански риболов със специализиран уред – далян с режим разрешителен
     * */
    DupPoundnetCommFish,
    /**
    * №267-4 - Издаване на удостоверение за извършване на стопански риболов със специализиран уред – далян с режим разрешителен
    * */
    PoundnetCommFishLic,
    /**
     * №267-7 - Дубликат на удостоверение за извършване на стопански риболов със специализиран уред – далян с режим разрешителен
     * */
    DupPoundnetCommFishLic,
    /**
     * №1806-3 - Намаляване на риболовен капацитет
     * */
    ReduceFishCap,
    /**
     * №1806 - Регистрация на риболовни кораби с режим регистрационен
     * */
    RegVessel,
    /**
     * №2354 - Издаване на свидетелство за придобиване на правоспособност за извършване на стопански риболов
     * */
    CommFishLicense,
    /**
     * №977 - Издаване на специално разрешително за улов на квотиран вид риба с режим разрешителен
     * */
    CatchQuataSpecies,
    /**
     * №977-3 - Дубликат на специално разрешително за улов на квотиран вид риба с режим разрешителен
     * */
    DupCatchQuataSpecies,
    /**
     * №2354-2 - Издаване на дубликат за свидетелство за правоспособност
     * */
    CompetencyDup,
    /**
     * №1806-4 - Увеличаване на риболовен капацитет
     * */
    IncreaseFishCap,
    /**
     * №2256 - Регистрация на центровете за първа продажба на продукти от риболов с режим регистрационен
     * */
    RegFirstSaleCenter,
    /**
     * №2165 - Регистрация на регистрирани купувачи за първа продажба на продукти от риболов с режим регистрационен
     * */
    RegFirstSaleBuyer,
    /**
     * №1806-1 - Отписване на кораб
     * */
    DeregShip,
    /**
     * №2165-1 - Промяна в обстоятелствата на регистриран купувач за първа продажба на продукти от риболов с режим регистрационен
     * */
    ChangeFirstSaleBuyer,
    /**
     * №2165-2 - Прекратяване на регистрация на регистриран купувач за първа продажба на продукти от риболов с режим регистрационен
     * */
    TermFirstSaleBuyer,
    /**
     * №2256-1 - Промяна в обстоятелствата на център за първа продажба на продукти от риболов с режим регистрационен
     * */
    ChangeFirstSaleCenter,
    /**
     * №2256-2 - Прекратяване на регистрация на център за първа продажба на продукти от риболов с режим регистрационен
     * */
    TermFirstSaleCenter,
    /**
     * №2165-3 - Дубликат на регистрация на регистриран купувач за първа продажба на продукти от риболов с режим регистрационен
     * */
    DupFirstSaleBuyer,
    /**
     * №2256-3 - Дубликат на регистрация на центровете за първа продажба на продукти от риболов с режим регистрационен
     * */
    DupFirstSaleCenter,
    /**
     * Събирателен pageCode за всички онлайн заявления (необходим заради NRequiredFileTypes)
     * */
    OnlineAppl,
    /**
    * page code за news management 
    * */
    NewsManagement,

    Inspections,
    SignInspections,
    ObservationAtSea,
    InspectionAtSea,
    InspectionAtPort,
    MobileInspections,

    /**
     * Страница от корабен риболовен дневник
     * */
    ShipLogBookPage,

    /**
     * Страница от дневник за Първа продажба
     * */
    FirstSaleLogBookPage,

    /**
     * Страница от дневник за Приемане
     * */
    AdmissionLogBookPage,

    /**
     * Страница от дневник за Превоз
     * */
    TransportationLogBookPage,

    /**
     * Страница от дневник за Аквакултурно стопанство
     * */
    AquacultureLogBookPage,

    /**
     * Регистър АУАН-и
     * */
    AuanRegister,

    /**
     * Регистър Наказателни постановления
     * */
    PenalDecrees,

    /**
     * Статистистически формуляр за аквакултурни стопанства
     * */
    StatFormAquaFarm,

    /**
     * Статистистически формуляр за преработка
     * */
    StatFormRework,

    /**
     * Статистистически формуляр за риболовни кораби
     * */
    StatFormFishVessel,

    /**
    * Маркиране на риболовни уреди
    * */
    FishingGearsCommFish,

    /**
     * За данни за връчване на регистров запис
     * */
    Delivery,

    /**
     * За данни за връчване в модул "Контролна дейност"
     * */
    InspDelivery,

    FVMS,

    migrate
}