export enum TariffCodesEnum {
    /**
     *  Достъп до електронна услуга за попълване на дневник за първа продажба
     * */
    e_First_Sell_Book,

    /**
     * Достъп до електронна услуга за попълване на дневник с декларации за приемане за 1г.
     * */
    e_Accept_Book,

    /**
     * Издаване на безсрочно разрешително за стопански риболов от кораби от трети държави
     * */
    a_1344,

    /**
     * Издаване на безсрочно разрешително за стопански риболов
     * */
    a_1211,

    /**
     * Предоставяне на риболовен дневник
     * */
    Log_Book,

    /**
     * Издаване на специално разрешително за улов на квотиран вид риба
     * */
    a_977_1,

    /**
     * Достъп до електронна услуга за попълване на електронен риболовен дневник за 1г.
     * */
    e_Log_Book,

    /**
     * Достъп до електронна услуга за попълване дневник на продажбите за 1г.
     * */
    e_Sell_Book,

    /**
     * Стандартен билет - 1 месец (месечен)
     * */
    Ticket_standard_monthly,

    /**
     * Билет за лица до 14-годишна възраст (безплатен) - До навършване на 14-годишна възраст
     * */
    Ticket_under14_until14,

    /**
     * Билет за хора с увреждания (безплатен) - До изтичане на ТЕЛК решение
     * */
    Ticket_disability_disability,

    /**
     * Билет за хора с увреждания (безплатен) - Без фиксиран срок
     * */
    Ticket_disability_noperiod,

    /**
     * Билет за лица от 14- до 18-годишна възраст - 6 месеца (шестмесечен)
     * */
    Ticket_between14and18_halfyearly,

    /**
     * Билет за лица от 14- до 18-годишна възраст - 1 месец (месечен)
     * */
    Ticket_between14and18_monthly,

    /**
     * Билет с намаление и прилагане на членска карта на сдружение по чл. 11 ЗРА - 12 месеца (годишен)
     * */
    Ticket_association_annual,

    /**
     * Билет с намаление и прилагане на членска карта на сдружение по чл. 11 ЗРА - 1 месец (месечен)
     * */
    Ticket_association_monthly,

    /**
     * Билет с намаление и прилагане на членска карта на сдружение по чл. 11 ЗРА - 1 седмица (седмичен)
     * */
    Ticket_association_weekly,

    /**
     * Билет за лицата на възраст над 60 години за жените и 65 години за мъжете - 12 месеца (годишен)
     * */
    Ticket_elder_annual,

    /**
     * Билет за лицата на възраст над 60 години за жените и 65 години за мъжете - 1 месец (месечен)
     * */
    Ticket_elder_monthly,

    /**
     * Билет за лицата на възраст над 60 години за жените и 65 години за мъжете - 1 седмица (седмичен)
     * */
    Ticket_elder_weekly,

    /**
     * Билет за лицата на възраст над 60 години за жените и 65 години за мъжете - 6 месеца (шестмесечен)
     * */
    Ticket_elder_halfyearly,

    /**
     * Предоставяне на дневник с декларации за приемане
     * */
    Accept_Book,

    /**
     * Маркиране на мрежен риболовен уред (за всеки 100м)
     * */
    Mark_Gear_100m,

    /**
     * Издаване на документ за регистрация на лице, развъждащо и отглеждащо риба и други водни организми
     * */
    a_1354,

    /**
     * Издаване на удостоверение за извършване на стопански риболов с риболовен кораб до 10 бруто тона с парагади
     * */
    a_1805_Ship_Till10_Longliners,

    /**
     * Издаване на удостоверение за извършване на стопански риболов с риболовен кораб до 10 бруто тона с риболовни уреди по букви "а" и "б"
     * и с други разрешени риболовни уреди
     * */
    a_1805_ShipTill10_Fishing_Gears,

    /**
     * Издаване на удостоверение за извършване на стопански риболов с риболовен кораб от 10 до 25 бруто тона с мрежени
     * и други разрешени риболовни уреди
     * */
    a_1805_Ship_Between_10_And_25,

    /**
     * Издаване на удостоверение за извършване на стопански риболов с риболовен кораб от 25 до 40 бруто тона с мрежени
     * и други разрешени риболовни уреди
     * */
    a_1805_Ship_Between_25_And_40,

    /**
     * Предоставяне на дневник за първа продажба
     * */
    First_Sell_Book,

    /**
     * Предоставяне на дневник на продажбите по чл. 27, т. 3
     * */
    Sell_Book,

    /**
     * Издаване на удостоверение за извършване на стопански риболов със специализиран уред – далян с режим разрешителен
     * */
    a_267_2_Poundnet_Comm_Fish_Lic,

    /**
     * Издаване на удостоверение за извършване на стопански улов на други видове
     * */
    a_1805_Other_Species_Fishing,

    /**
     * Вписване в регистъра на лицата купувачи при първа продажба на продукти от риболов
     * */
    a_2165_Reg_First_Sale_Buyer,

    /**
     * Вписване в регистъра на центровете за първа продажба на продукти от риболов
     * */
    a_2256_Reg_First_Sale_Center,

    /**
     * Издаване дубликат на документ, удостоверяващ право за извършване на стопански риболов
     * */
    a_2354_2_Competency_Dup,

    /**
     * Издаване на удостоверение за извършване на стопански риболов с риболовен кораб до 10 бруто тона с мрежени уреди, волти и чепарета
     * */
    a_1805_Ship_Till10_Nets,

    /**
     * Издаване на удостоверение за извършване на стопански риболов с риболовен кораб от 25 до 40 бруто тона с мрежени
     * и други разрешени риболовни уреди
     * */
    a_1805_Ship_Between_Over40,

    /**
     * Издаване на удостоверение за извършване на стопански риболов в крайморски езера и блата с един езерен стационарен риболовен уред
     * или с един езерен гриб
     * */
    a_1805_Lakes_And_Swamps_Stat_Fishing_Gears,

    /**
     * Издаване на удостоверение за извършване на стопански риболов във водите на р. Дунав с риболовен кораб с мрежени риболовни уреди
     * */
    a_1805_Dunav_Ship_Nets,

    /**
     * Издаване на удостоверение за извършване на стопански риболов във водите на р. Дунав с риболовен кораб с капани (винтери)
     * за улов на риба и други водни организми
     * */
    a_1805_Dunav_Ship_Fishing_Traps,

    /**
     * Издаване на удостоверение за извършване на стопански риболов във водите на р. Дунав с риболовен кораб с мрежени риболовни уреди
     * и с капани (винтери) за улов на риба и други водни организми
     * */
    a_1805_Dunav_Ship_Nets_And_Fishing_Traps,

    /**
     * Издаване на удостоверение за извършване на стопански риболов във водите на р. Дунав в специализиран обект по чл. 3, ал. 1, т. 3
     * от закона - тоня, с гриб
     * */
    a_1805_Dunav_Spec_Utility,

    /**
     * Издаване на удостоверение за извършване на стопански риболов във водите на р. Дунав (изм. - ДВ, бр. 30 от 2007 г., в сила от 10.04.2007 г.)
     * на есетрови риби с всякакви разрешени риболовни уреди
     * */
    a_1805_Dunav_Sturgeon_Fish,

    /**
     * Издаване на удостоверение за извършване на стопански улов на рапани
     * */
    a_1805_Rapan,

    /**
     * Издаване на удостоверение за извършване на стопански улов на миди и скариди
     * */
    a_1805_Mussels_Shrimps,

    /**
     * Издаване на удостоверение за извършване на стопански улов на жаби
     * */
    a_1805_Frogs,

    /**
     * Издаване на удостоверение за извършване на стопански улов на езерен рак
     * */
    a_1805_Lake_Crab,

    /**
     * Участие в обучение и полагане на изпит за придобиване на правоспособност за извършване на стопански риболов
     * */
    a_2354_1_Aptitude_Cource_Exam,

    /**
     * Черно море - В специализиран обект по чл. 3, ал. 1, т. 3 от закона - за далян от първа категория
     * */
    a_1805_Sea_Aqua_Pound_Net_Cat_1,

    /**
     * Черно море - В специализиран обект по чл. 3, ал. 1, т. 3 от закона - за далян от втора категория
     * */
    a_1805_Sea_Aqua_Pound_Net_Cat_2,

    /**
     * Черно море - В специализиран обект по чл. 3, ал. 1, т. 3 от закона - за воля с дължина на гриба над 450 м
     * */
    a_1805_Sea_Aqua_Grib_Above_450,

    /**
     * Черно море - В специализиран обект по чл. 3, ал. 1, т. 3 от закона - за воля с дължина на гриба до 450 м
     * */
    a_1805_Sea_Aqua_Grib_Below_450,

    /**
     * Черно море - В специализиран обект по чл. 3, ал. 1, т. 3 от закона - за воля с дължина на гриба до 100 м
     * */
    a_1805_Sea_Aqua_Grib_Below_100,

    /**
     * Черно море - В крайморски езера и блата с други разрешени риболовни уреди, извън тези по буква "а"
     * */
    a_1805_Lakes_And_Swamps_Other_Fishing_Gears,

    /**
     * За придобиване на право за извършване на стопански риболов в рибностопански обекти по чл. 3, ал. 1, т. 2 от ЗДС или в зони от тях
     * */
    a_1805_Old_Aqua,

    /**
     * Стандартен билет - 12 месеца (годишен)
     * */
    Ticket_standard_annual,

    /**
     * Стандартен билет - 1 седмица (седмичен)
     * */
    Ticket_standard_weekly,

    /**
     * Стандартен билет - 6 месеца (шестмесечен)
     * */
    Ticket_standard_halfyearly,

    /**
     * Билет за лица от 14- до 18-годишна възраст - 12 месеца (годишен)
     * */
    Ticket_between14and18_annual,

    /**
     * Билет за лица от 14- до 18-годишна възраст - 1 седмица (седмичен)
     * */
    Ticket_between14and18_weekly,

    /**
     * Билет с намаление и прилагане на членска карта на сдружение по чл. 11 ЗРА - 6 месеца (шестмесечен)
     * */
    Ticket_association_halfyearly,

    /**
     * Билет за лицата на възраст над 60 години за жените и 65 години за мъжете членуващи в сдружение - 1 месец (месечен)
     * */
    Ticket_elderassociation_monthly,

    /**
     * Билет за лицата на възраст над 60 години за жените и 65 години за мъжете членуващи в сдружение - 12 месеца (годишен)
     * */
    Ticket_elderassociation_annual,

    /**
     * Билет за лица от 14- до 18-годишна възраст членуващи в сдружение - 1 седмица (седмичен)
     * */
    Ticket_between14and18association_weekly,

    /**
     * Дубликат на билет за любителски риболов
     * */
    Ticket_duplicate,

    /**
     * Билет за лица от 14- до 18-годишна възраст членуващи в сдружение - 12 месеца (годишен)
     * */
    Ticket_between14and18association_annual,

    /**
     * Билет за лица от 14- до 18-годишна възраст членуващи в сдружение - 6 месеца (шестмесечен)
     * */
    Ticket_between14and18association_halfyearly,

    /**
     * Билет за лицата на възраст над 60 години за жените и 65 години за мъжете членуващи в сдружение - 1 седмица (седмичен)
     * */
    Ticket_elderassociation_weekly,

    /**
     * Билет за лицата на възраст над 60 години за жените и 65 години за мъжете членуващи в сдружение - 6 месеца (шестмесечен)
     * */
    Ticket_elderassociation_halfyearly,

    /**
     * Билет за лица от 14- до 18-годишна възраст членуващи в сдружение - 1 месец (месечен)
     * */
    Ticket_between14and18association_monthly,

    /**
     * Дубликат на купувач
     * */
    a_2165_3_buyer_dup,

    /**
     * Дубликат на ЦПП
     * */
    a_2256_3_first_sale_dup,

    /**
     * Дубликат на разрешително за извършване на стопански риболов с далян
     * */
    a_267_3_poundnet_commfish_dup,

    /**
     * Дубликат на удостоверение за извършване на стопански риболов с далян
     * */
    a_267_7_poundnet_commfish_lic_dup,

    /**
     * Дубликат на специално разрешително за улов на квотиран вид риба
     * */
    a_977_3_catch_quota_dup,

    /**
     * Дубликат на разрешително за извършване на стопански риболов
     * */
    a_1211_3_commfish_dup,

    /**
     * Дубликат на разрешително за извършване на стопански риболов от кораби от трети страни
     * */
    a_1344_1_right_to_fish_third_dup,

    /**
     * Дубликат на удостоверение за придобито право за усвояване на ресурс на риба и други водни организми
     * */
    a_1805_3_right_to_fish_res_dup
}